+ function($) {
    'use strict';

    // ADDRESS CLASS DEFINITION
    // ======================
    var Address = function(element, options) {
        this.$element = $(element)
        this.options = options
        this.tools = this.TOOLS()
    }

    Address.DEFAULTS = {

    }

    Address.EVENTS = {
        afterCreated: 'aftercreated.bjui.address'
    }

    Address.province = ["北京市", "天津市", "河北省", "山西省", "内蒙古自治区", "辽宁省", "吉林省", "黑龙江省", "上海市", "江苏省", "浙江省", "安徽省", "福建省", "江西省", "山东省", "河南省", "湖北省", "湖南省", "广东省", "广西壮族自治区", "海南省", "重庆市", "四川省", "贵州省", "云南省", "西藏自治区", "陕西省", "甘肃省", "青海省", "宁夏回族自治区", "新疆维吾尔自治区", "台湾省", "香港特别行政区", "澳门特别行政区"];
    Address.city = {
        "北京市": ["北京市"],
        "天津市": ["天津市"],
        "上海市": ["上海市"],
        "重庆市": ["重庆市"],
        "河北省": ["邯郸市", "秦皇岛市", "唐山市", "石家庄市", "衡水市", "廊坊市", "沧州市", "承德市", "张家口市", "保定市", "邢台市"],
        "山西省": ["吕梁市", "临汾市", "忻州市", "运城市", "晋中市", "朔州市", "晋城市", "长治市", "阳泉市", "大同市", "太原市"],
        "内蒙古自治区": ["阿拉善盟", "锡林郭勒盟", "兴安盟", "乌兰察布市", "巴彦淖尔市", "呼伦贝尔市", "鄂尔多斯市", "通辽市", "赤峰市", "乌海市", "包头市", "呼和浩特市"],
        "辽宁省": ["葫芦岛市", "朝阳市", "铁岭市", "盘锦市", "辽阳市", "阜新市", "营口市", "锦州市", "丹东市", "本溪市", "抚顺市", "鞍山市", "大连市", "沈阳市"],
        "吉林省": ["延边朝鲜族自治州", "白城市", "松原市", "白山市", "通化市", "辽源市", "四平市", "吉林市", "长春市"],
        "黑龙江省": ["大庆市", "双鸭山市", "鹤岗市", "鸡西市", "齐齐哈尔市", "哈尔滨市", "大兴安岭地区", "绥化市", "黑河市", "牡丹江市", "七台河市", "佳木斯市", "伊春市"],
        "江苏省": ["宿迁市", "泰州市", "镇江市", "扬州市", "盐城市", "淮安市", "连云港市", "南通市", "苏州市", "常州市", "徐州市", "无锡市", "南京市"],
        "浙江省": ["舟山市", "衢州市", "金华市", "绍兴市", "湖州市", "嘉兴市", "温州市", "宁波市", "杭州市", "丽水市", "台州市"],
        "安徽省": ["宣城市", "池州市", "亳州市", "六安市", "宿州市", "阜阳市", "滁州市", "黄山市", "安庆市", "铜陵市", "淮北市", "马鞍山市", "淮南市", "蚌埠市", "芜湖市", "合肥市"],
        "福建省": ["宁德市", "龙岩市", "南平市", "漳州市", "泉州市", "三明市", "莆田市", "厦门市", "福州市"],
        "江西省": ["景德镇市", "南昌市", "上饶市", "抚州市", "宜春市", "吉安市", "赣州市", "鹰潭市", "新余市", "九江市", "萍乡市"],
        "山东省": ["菏泽市", "滨州市", "聊城市", "德州市", "临沂市", "莱芜市", "日照市", "威海市", "泰安市", "济宁市", "潍坊市", "烟台市", "东营市", "枣庄市", "淄博市", "青岛市", "济南市"],
        "河南省": ["平顶山市", "洛阳市", "开封市", "郑州市", "河南省直辖县级行政区划", "驻马店市", "周口市", "信阳市", "商丘市", "南阳市", "三门峡市", "漯河市", "许昌市", "濮阳市", "焦作市", "新乡市", "鹤壁市", "安阳市"],
        "湖北省": ["湖北省直辖县级行政区划", "恩施土家族苗族自治州", "随州市", "咸宁市", "黄冈市", "荆州市", "孝感市", "荆门市", "鄂州市", "襄阳市", "宜昌市", "十堰市", "黄石市", "武汉市"],
        "湖南省": ["株洲市", "长沙市", "湘西土家族苗族自治州", "娄底市", "怀化市", "永州市", "郴州市", "益阳市", "张家界市", "常德市", "岳阳市", "邵阳市", "衡阳市", "湘潭市"],
        "广东省": ["潮州市", "中山市", "东莞市", "清远市", "阳江市", "河源市", "汕尾市", "梅州市", "惠州市", "肇庆市", "茂名市", "湛江市", "江门市", "佛山市", "汕头市", "珠海市", "深圳市", "韶关市", "广州市", "云浮市", "揭阳市"],
        "广西壮族自治区": ["崇左市", "来宾市", "河池市", "贺州市", "百色市", "玉林市", "贵港市", "钦州市", "防城港市", "北海市", "梧州市", "桂林市", "柳州市", "南宁市"],
        "海南省": ["海南省直辖县级行政区划", "三沙市", "三亚市", "海口市"],
        "四川省": ["遂宁市", "广元市", "绵阳市", "德阳市", "泸州市", "攀枝花市", "自贡市", "成都市", "凉山彝族自治州", "甘孜藏族自治州", "阿坝藏族羌族自治州", "资阳市", "巴中市", "雅安市", "达州市", "广安市", "宜宾市", "眉山市", "南充市", "乐山市", "内江市"],
        "贵州省": ["黔南布依族苗族自治州", "黔东南苗族侗族自治州", "黔西南布依族苗族自治州", "铜仁市", "毕节市", "安顺市", "遵义市", "六盘水市", "贵阳市"],
        "云南省": ["临沧市", "普洱市", "丽江市", "昭通市", "保山市", "玉溪市", "曲靖市", "昆明市", "迪庆藏族自治州", "怒江傈僳族自治州", "德宏傣族景颇族自治州", "大理白族自治州", "西双版纳傣族自治州", "文山壮族苗族自治州", "红河哈尼族彝族自治州", "楚雄彝族自治州"],
        "西藏自治区": ["林芝地区", "阿里地区", "那曲地区", "山南地区", "昌都市", "日喀则市", "拉萨市"],
        "陕西省": ["商洛市", "安康市", "榆林市", "汉中市", "延安市", "渭南市", "咸阳市", "宝鸡市", "铜川市", "西安市"],
        "甘肃省": ["白银市", "金昌市", "嘉峪关市", "兰州市", "甘南藏族自治州", "临夏回族自治州", "陇南市", "定西市", "庆阳市", "酒泉市", "平凉市", "张掖市", "武威市", "天水市"],
        "青海省": ["海西蒙古族藏族自治州", "玉树藏族自治州", "果洛藏族自治州", "海南藏族自治州", "黄南藏族自治州", "海北藏族自治州", "海东市", "西宁市"],
        "宁夏回族自治区": ["中卫市", "固原市", "吴忠市", "石嘴山市", "银川市"],
        "新疆维吾尔自治区": ["博尔塔拉蒙古自治州", "昌吉回族自治州", "哈密地区", "吐鲁番地区", "克拉玛依市", "乌鲁木齐市", "自治区直辖县级行政区划", "伊犁哈萨克自治州", "和田地区", "喀什地区", "克孜勒苏柯尔克孜自治州", "阿克苏地区", "巴音郭楞蒙古自治州"],
        "台湾省": ["澎湖县", "花莲县", "台东县", "屏东县", "嘉义县", "云林县", "南投县", "彰化县", "苗栗县", "新竹县", "桃园县", "宜兰县", "新北市", "嘉义市", "新竹市", "台南市", "台中市", "基隆市", "高雄市", "台北市"],
        "香港特别行政区": ["新界", "九龙", "香港岛"],
        "澳门特别行政区": ["路环岛", "氹仔岛", "澳门半岛"]
    };
    Address.county = {
        "北京市": ["门头沟区", "海淀区", "石景山区", "丰台区", "朝阳区", "西城区", "东城区", "延庆县", "密云县", "平谷区", "怀柔区", "大兴区", "昌平区", "顺义区", "通州区", "房山区"],
        "天津市": ["蓟县", "静海县", "宁河县", "滨海新区", "宝坻区", "武清区", "北辰区", "津南区", "西青区", "东丽区", "红桥区", "河北区", "南开区", "河西区", "河东区", "和平区"],
        "石家庄市": ["藁城区", "裕华区", "井陉矿区", "新华区", "桥西区", "长安区", "市辖区", "新乐市", "晋州市", "辛集市", "赵县", "元氏县", "平山县", "无极县", "赞皇县", "深泽县", "高邑县", "灵寿县", "行唐县", "正定县", "井陉县", "栾城区", "鹿泉区"],
        "唐山市": ["迁安市", "遵化市", "玉田县", "迁西县", "乐亭县", "滦南县", "滦县", "曹妃甸区", "丰润区", "丰南区", "开平区", "古冶区", "路北区", "路南区", "市辖区"],
        "秦皇岛市": ["市辖区", "卢龙县", "抚宁县", "昌黎县", "青龙满族自治县", "北戴河区", "山海关区", "海港区"],
        "邯郸市": ["武安市", "曲周县", "魏县", "馆陶县", "广平县", "鸡泽县", "邱县", "永年县", "肥乡县", "磁县", "涉县", "大名县", "成安县", "临漳县", "邯郸县", "峰峰矿区", "复兴区", "丛台区", "邯山区", "市辖区"],
        "邢台市": ["临城县", "邢台县", "桥西区", "桥东区", "市辖区", "沙河市", "南宫市", "临西县", "清河县", "威县", "平乡县", "广宗县", "新河县", "巨鹿县", "宁晋县", "南和县", "任县", "隆尧县", "柏乡县", "内丘县"],
        "保定市": ["易县", "安新县", "望都县", "涞源县", "容城县", "高阳县", "唐县", "定兴县", "徐水县", "阜平县", "涞水县", "清苑县", "满城县", "南市区", "北市区", "新市区", "市辖区", "高碑店市", "安国市", "定州市", "涿州市", "雄县", "博野县", "顺平县", "蠡县", "曲阳县"],
        "张家口市": ["崇礼县", "赤城县", "涿鹿县", "怀来县", "万全县", "怀安县", "阳原县", "蔚县", "尚义县", "沽源县", "康保县", "张北县", "宣化县", "下花园区", "宣化区", "桥西区", "桥东区", "市辖区"],
        "承德市": ["承德县", "鹰手营子矿区", "双滦区", "双桥区", "市辖区", "围场满族蒙古族自治县", "宽城满族自治县", "丰宁满族自治县", "隆化县", "滦平县", "平泉县", "兴隆县"],
        "沧州市": ["河间市", "黄骅市", "任丘市", "泊头市", "孟村回族自治县", "献县", "吴桥县", "南皮县", "肃宁县", "盐山县", "海兴县", "东光县", "青县", "沧县", "运河区", "新华区", "市辖区"],
        "廊坊市": ["文安县", "大城县", "香河县", "永清县", "固安县", "广阳区", "安次区", "市辖区", "三河市", "霸州市", "大厂回族自治县"],
        "衡水市": ["深州市", "冀州市", "阜城县", "景县", "故城县", "安平县", "饶阳县", "武强县", "武邑县", "枣强县", "桃城区", "市辖区"],
        "太原市": ["古交市", "娄烦县", "阳曲县", "清徐县", "晋源区", "万柏林区", "尖草坪区", "杏花岭区", "迎泽区", "小店区", "市辖区"],
        "大同市": ["阳高县", "新荣区", "南郊区", "矿区", "城区", "市辖区", "大同县", "左云县", "浑源县", "灵丘县", "广灵县", "天镇县"],
        "阳泉市": ["盂县", "平定县", "郊区", "矿区", "城区", "市辖区"],
        "长治市": ["潞城市", "沁源县", "沁县", "武乡县", "长子县", "壶关县", "黎城县", "平顺县", "屯留县", "襄垣县", "长治县", "郊区", "城区", "市辖区"],
        "晋城市": ["泽州县", "陵川县", "阳城县", "沁水县", "城区", "市辖区", "高平市"],
        "朔州市": ["怀仁县", "右玉县", "应县", "山阴县", "平鲁区", "朔城区", "市辖区"],
        "晋中市": ["介休市", "灵石县", "平遥县", "祁县", "太谷县", "寿阳县", "昔阳县", "和顺县", "左权县", "榆社县", "榆次区", "市辖区"],
        "运城市": ["芮城县", "平陆县", "夏县", "垣曲县", "绛县", "新绛县", "稷山县", "闻喜县", "万荣县", "临猗县", "盐湖区", "市辖区", "河津市", "永济市"],
        "忻州市": ["原平市", "偏关县", "保德县", "河曲县", "岢岚县", "五寨县", "神池县", "静乐县", "宁武县", "繁峙县", "代县", "五台县", "定襄县", "忻府区", "市辖区"],
        "临汾市": ["蒲县", "永和县", "隰县", "大宁县", "乡宁县", "吉县", "浮山县", "安泽县", "古县", "洪洞县", "襄汾县", "翼城县", "曲沃县", "尧都区", "市辖区", "霍州市", "侯马市", "汾西县"],
        "吕梁市": ["汾阳市", "孝义市", "交口县", "中阳县", "方山县", "岚县", "石楼县", "柳林县", "临县", "兴县", "交城县", "文水县", "离石区", "市辖区"],
        "呼和浩特市": ["武川县", "清水河县", "和林格尔县", "托克托县", "土默特左旗", "赛罕区", "玉泉区", "回民区", "新城区", "市辖区"],
        "包头市": ["石拐区", "青山区", "昆都仑区", "东河区", "市辖区", "达尔罕茂明安联合旗", "固阳县", "土默特右旗", "九原区", "白云鄂博矿区"],
        "乌海市": ["乌达区", "海南区", "海勃湾区", "市辖区"],
        "赤峰市": ["敖汉旗", "宁城县", "喀喇沁旗", "翁牛特旗", "克什克腾旗", "林西县", "巴林右旗", "巴林左旗", "阿鲁科尔沁旗", "松山区", "元宝山区", "红山区", "市辖区"],
        "通辽市": ["霍林郭勒市", "扎鲁特旗", "奈曼旗", "库伦旗", "开鲁县", "科尔沁左翼后旗", "科尔沁左翼中旗", "科尔沁区", "市辖区"],
        "鄂尔多斯市": ["市辖区", "伊金霍洛旗", "乌审旗", "杭锦旗", "鄂托克旗", "鄂托克前旗", "准格尔旗", "达拉特旗", "东胜区"],
        "呼伦贝尔市": ["根河市", "额尔古纳市", "扎兰屯市", "牙克石市", "满洲里市", "新巴尔虎右旗", "新巴尔虎左旗", "陈巴尔虎旗", "鄂温克族自治旗", "鄂伦春自治旗", "莫力达瓦达斡尔族自治旗", "阿荣旗", "扎赉诺尔区", "海拉尔区", "市辖区"],
        "巴彦淖尔市": ["杭锦后旗", "乌拉特后旗", "乌拉特中旗", "乌拉特前旗", "磴口县", "五原县", "临河区", "市辖区"],
        "乌兰察布市": ["市辖区", "丰镇市", "四子王旗", "察哈尔右翼后旗", "察哈尔右翼中旗", "察哈尔右翼前旗", "凉城县", "兴和县", "商都县", "化德县", "卓资县", "集宁区"],
        "兴安盟": ["突泉县", "扎赉特旗", "科尔沁右翼中旗", "科尔沁右翼前旗", "阿尔山市", "乌兰浩特市"],
        "锡林郭勒盟": ["多伦县", "正蓝旗", "正镶白旗", "镶黄旗", "太仆寺旗", "西乌珠穆沁旗", "东乌珠穆沁旗", "苏尼特右旗", "苏尼特左旗", "阿巴嘎旗", "锡林浩特市", "二连浩特市"],
        "阿拉善盟": ["额济纳旗", "阿拉善右旗", "阿拉善左旗"],
        "沈阳市": ["新民市", "法库县", "康平县", "辽中县", "于洪区", "沈北新区", "浑南区", "苏家屯区", "铁西区", "皇姑区", "大东区", "沈河区", "和平区", "市辖区"],
        "大连市": ["庄河市", "普兰店市", "瓦房店市", "长海县", "金州区", "旅顺口区", "甘井子区", "沙河口区", "西岗区", "中山区", "市辖区"],
        "鞍山市": ["岫岩满族自治县", "台安县", "千山区", "立山区", "铁西区", "铁东区", "市辖区", "海城市"],
        "抚顺市": ["清原满族自治县", "新宾满族自治县", "抚顺县", "顺城区", "望花区", "东洲区", "新抚区", "市辖区"],
        "本溪市": ["桓仁满族自治县", "本溪满族自治县", "南芬区", "明山区", "溪湖区", "平山区", "市辖区"],
        "丹东市": ["凤城市", "东港市", "宽甸满族自治县", "振安区", "振兴区", "元宝区", "市辖区"],
        "锦州市": ["北镇市", "凌海市", "义县", "黑山县", "凌河区", "太和区", "古塔区", "市辖区"],
        "营口市": ["站前区", "市辖区", "大石桥市", "盖州市", "老边区", "鲅鱼圈区", "西市区"],
        "阜新市": ["彰武县", "阜新蒙古族自治县", "细河区", "清河门区", "太平区", "新邱区", "海州区", "市辖区"],
        "辽阳市": ["灯塔市", "辽阳县", "太子河区", "弓长岭区", "宏伟区", "文圣区", "白塔区", "市辖区"],
        "盘锦市": ["盘山县", "大洼县", "兴隆台区", "双台子区", "市辖区"],
        "铁岭市": ["昌图县", "西丰县", "铁岭县", "清河区", "银州区", "市辖区", "开原市", "调兵山市"],
        "朝阳市": ["凌源市", "北票市", "喀喇沁左翼蒙古族自治县", "建平县", "朝阳县", "龙城区", "双塔区", "市辖区"],
        "葫芦岛市": ["兴城市", "建昌县", "绥中县", "南票区", "龙港区", "连山区", "市辖区"],
        "长春市": ["德惠市", "榆树市", "农安县", "九台区", "双阳区", "绿园区", "二道区", "朝阳区", "宽城区", "南关区", "市辖区"],
        "吉林市": ["船营区", "龙潭区", "昌邑区", "市辖区", "磐石市", "舒兰市", "桦甸市", "蛟河市", "永吉县", "丰满区"],
        "四平市": ["双辽市", "公主岭市", "伊通满族自治县", "梨树县", "铁东区", "铁西区", "市辖区"],
        "辽源市": ["东辽县", "东丰县", "西安区", "龙山区", "市辖区"],
        "通化市": ["集安市", "梅河口市", "柳河县", "辉南县", "通化县", "二道江区", "东昌区", "市辖区"],
        "白山市": ["长白朝鲜族自治县", "靖宇县", "抚松县", "江源区", "浑江区", "市辖区", "临江市"],
        "松原市": ["扶余市", "乾安县", "长岭县", "前郭尔罗斯蒙古族自治县", "宁江区", "市辖区"],
        "白城市": ["大安市", "洮南市", "通榆县", "镇赉县", "洮北区", "市辖区"],
        "延边朝鲜族自治州": ["安图县", "汪清县", "和龙市", "龙井市", "珲春市", "敦化市", "图们市", "延吉市"],
        "哈尔滨市": ["依兰县", "双城区", "阿城区", "呼兰区", "香坊区", "松北区", "平房区", "道外区", "南岗区", "道里区", "市辖区", "五常市", "尚志市", "延寿县", "通河县", "木兰县", "巴彦县", "宾县", "方正县"],
        "齐齐哈尔市": ["讷河市", "拜泉县", "克东县", "克山县", "富裕县", "甘南县", "泰来县", "依安县", "龙江县", "梅里斯达斡尔族区", "碾子山区", "富拉尔基区", "昂昂溪区", "铁锋区", "建华区", "龙沙区", "市辖区"],
        "鸡西市": ["麻山区", "城子河区", "梨树区", "滴道区", "恒山区", "鸡冠区", "市辖区", "密山市", "虎林市", "鸡东县"],
        "鹤岗市": ["绥滨县", "萝北县", "兴山区", "东山区", "兴安区", "南山区", "工农区", "向阳区", "市辖区"],
        "双鸭山市": ["饶河县", "宝清县", "友谊县", "集贤县", "宝山区", "四方台区", "岭东区", "尖山区", "市辖区"],
        "大庆市": ["杜尔伯特蒙古族自治县", "林甸县", "肇源县", "肇州县", "大同区", "红岗区", "让胡路区", "龙凤区", "萨尔图区", "市辖区"],
        "伊春市": ["市辖区", "铁力市", "嘉荫县", "上甘岭区", "红星区", "乌伊岭区", "带岭区", "汤旺河区", "乌马河区", "五营区", "金山屯区", "美溪区", "新青区", "翠峦区", "西林区", "友好区", "南岔区", "伊春区"],
        "佳木斯市": ["富锦市", "同江市", "抚远县", "汤原县", "桦川县", "桦南县", "郊区", "东风区", "前进区", "向阳区", "市辖区"],
        "七台河市": ["茄子河区", "桃山区", "新兴区", "市辖区", "勃利县"],
        "牡丹江市": ["穆棱市", "宁安市", "海林市", "绥芬河市", "林口县", "东宁县", "西安区", "爱民区", "阳明区", "东安区", "市辖区"],
        "黑河市": ["五大连池市", "北安市", "孙吴县", "逊克县", "嫩江县", "爱辉区", "市辖区"],
        "绥化市": ["海伦市", "肇东市", "安达市", "绥棱县", "明水县", "庆安县", "青冈县", "兰西县", "望奎县", "北林区", "市辖区"],
        "大兴安岭地区": ["塔河县", "呼玛县", "漠河县"],
        "上海市": ["崇明县", "奉贤区", "青浦区", "松江区", "金山区", "浦东新区", "嘉定区", "宝山区", "闵行区", "杨浦区", "虹口区", "闸北区", "普陀区", "静安区", "长宁区", "徐汇区", "黄浦区"],
        "南京市": ["高淳区", "溧水区", "六合区", "江宁区", "雨花台区", "栖霞区", "浦口区", "鼓楼区", "建邺区", "秦淮区", "玄武区", "市辖区"],
        "无锡市": ["崇安区", "市辖区", "宜兴市", "江阴市", "滨湖区", "惠山区", "锡山区", "北塘区", "南长区"],
        "徐州市": ["邳州市", "新沂市", "睢宁县", "沛县", "丰县", "铜山区", "泉山区", "贾汪区", "云龙区", "鼓楼区", "市辖区"],
        "常州市": ["金坛市", "溧阳市", "武进区", "新北区", "戚墅堰区", "钟楼区", "天宁区", "市辖区"],
        "苏州市": ["吴江区", "姑苏区", "相城区", "吴中区", "虎丘区", "市辖区", "太仓市", "昆山市", "张家港市", "常熟市"],
        "南通市": ["海门市", "如皋市", "启东市", "如东县", "海安县", "通州区", "港闸区", "崇川区", "市辖区"],
        "连云港市": ["灌南县", "灌云县", "东海县", "赣榆区", "海州区", "连云区", "市辖区"],
        "淮安市": ["金湖县", "盱眙县", "洪泽县", "涟水县", "清浦区", "淮阴区", "淮安区", "清河区", "市辖区"],
        "盐城市": ["盐都区", "亭湖区", "市辖区", "大丰市", "东台市", "建湖县", "射阳县", "阜宁县", "滨海县", "响水县"],
        "扬州市": ["高邮市", "仪征市", "宝应县", "江都区", "邗江区", "广陵区", "市辖区"],
        "镇江市": ["句容市", "扬中市", "丹阳市", "丹徒区", "润州区", "京口区", "市辖区"],
        "泰州市": ["泰兴市", "靖江市", "兴化市", "姜堰区", "高港区", "海陵区", "市辖区"],
        "宿迁市": ["沭阳县", "宿豫区", "宿城区", "市辖区", "泗洪县", "泗阳县"],
        "杭州市": ["临安市", "建德市", "淳安县", "桐庐县", "富阳区", "余杭区", "萧山区", "滨江区", "西湖区", "拱墅区", "江干区", "下城区", "上城区", "市辖区"],
        "宁波市": ["奉化市", "慈溪市", "余姚市", "宁海县", "象山县", "鄞州区", "镇海区", "北仑区", "江北区", "江东区", "海曙区", "市辖区"],
        "温州市": ["瓯海区", "龙湾区", "鹿城区", "市辖区", "乐清市", "瑞安市", "泰顺县", "文成县", "苍南县", "平阳县", "永嘉县", "洞头县"],
        "嘉兴市": ["桐乡市", "平湖市", "海宁市", "海盐县", "嘉善县", "秀洲区", "南湖区", "市辖区"],
        "湖州市": ["安吉县", "长兴县", "德清县", "南浔区", "吴兴区", "市辖区"],
        "绍兴市": ["嵊州市", "诸暨市", "新昌县", "上虞区", "柯桥区", "越城区", "市辖区"],
        "金华市": ["金东区", "婺城区", "市辖区", "永康市", "东阳市", "义乌市", "兰溪市", "磐安县", "浦江县", "武义县"],
        "衢州市": ["江山市", "龙游县", "开化县", "常山县", "衢江区", "柯城区", "市辖区"],
        "舟山市": ["嵊泗县", "岱山县", "普陀区", "定海区", "市辖区"],
        "台州市": ["临海市", "温岭市", "仙居县", "天台县", "三门县", "玉环县", "路桥区", "黄岩区", "椒江区", "市辖区"],
        "丽水市": ["青田县", "莲都区", "市辖区", "龙泉市", "景宁畲族自治县", "庆元县", "云和县", "松阳县", "遂昌县", "缙云县"],
        "合肥市": ["巢湖市", "庐江县", "肥西县", "肥东县", "长丰县", "包河区", "蜀山区", "庐阳区", "瑶海区", "市辖区"],
        "芜湖市": ["无为县", "南陵县", "繁昌县", "芜湖县", "三山区", "鸠江区", "弋江区", "镜湖区", "市辖区"],
        "蚌埠市": ["五河县", "怀远县", "淮上区", "禹会区", "蚌山区", "龙子湖区", "市辖区", "固镇县"],
        "淮南市": ["凤台县", "潘集区", "八公山区", "谢家集区", "田家庵区", "大通区", "市辖区"],
        "马鞍山市": ["和县", "含山县", "当涂县", "博望区", "雨山区", "花山区", "市辖区"],
        "淮北市": ["濉溪县", "烈山区", "相山区", "杜集区", "市辖区"],
        "铜陵市": ["铜陵县", "郊区", "狮子山区", "铜官山区", "市辖区"],
        "安庆市": ["潜山县", "枞阳县", "怀宁县", "宜秀区", "大观区", "迎江区", "市辖区", "桐城市", "岳西县", "望江县", "宿松县", "太湖县"],
        "黄山市": ["祁门县", "黟县", "休宁县", "歙县", "徽州区", "黄山区", "屯溪区", "市辖区"],
        "滁州市": ["明光市", "天长市", "凤阳县", "定远县", "全椒县", "来安县", "南谯区", "琅琊区", "市辖区"],
        "阜阳市": ["界首市", "颍上县", "阜南县", "太和县", "临泉县", "颍泉区", "颍东区", "颍州区", "市辖区"],
        "宿州市": ["市辖区", "泗县", "灵璧县", "萧县", "砀山县", "埇桥区"],
        "六安市": ["霍山县", "金寨县", "舒城县", "霍邱县", "寿县", "裕安区", "金安区", "市辖区"],
        "亳州市": ["利辛县", "蒙城县", "涡阳县", "谯城区", "市辖区"],
        "池州市": ["青阳县", "石台县", "东至县", "贵池区", "市辖区"],
        "宣城市": ["宁国市", "旌德县", "绩溪县", "泾县", "广德县", "郎溪县", "宣州区", "市辖区"],
        "福州市": ["市辖区", "长乐市", "福清市", "平潭县", "永泰县", "闽清县", "罗源县", "连江县", "闽侯县", "晋安区", "马尾区", "仓山区", "台江区", "鼓楼区"],
        "厦门市": ["翔安区", "同安区", "集美区", "湖里区", "海沧区", "思明区", "市辖区"],
        "莆田市": ["仙游县", "秀屿区", "荔城区", "涵江区", "城厢区", "市辖区"],
        "三明市": ["宁化县", "清流县", "明溪县", "三元区", "梅列区", "市辖区", "永安市", "建宁县", "泰宁县", "将乐县", "沙县", "尤溪县", "大田县"],
        "泉州市": ["南安市", "晋江市", "石狮市", "金门县", "德化县", "永春县", "安溪县", "惠安县", "泉港区", "洛江区", "丰泽区", "鲤城区", "市辖区"],
        "漳州市": ["龙海市", "华安县", "平和县", "南靖县", "东山县", "长泰县", "诏安县", "漳浦县", "云霄县", "龙文区", "芗城区", "市辖区"],
        "南平市": ["建瓯市", "武夷山市", "邵武市", "政和县", "松溪县", "光泽县", "浦城县", "顺昌县", "建阳区", "延平区", "市辖区"],
        "龙岩市": ["漳平市", "连城县", "武平县", "上杭县", "长汀县", "永定区", "新罗区", "市辖区"],
        "宁德市": ["福鼎市", "福安市", "柘荣县", "周宁县", "寿宁县", "屏南县", "古田县", "霞浦县", "蕉城区", "市辖区"],
        "南昌市": ["西湖区", "东湖区", "市辖区", "进贤县", "安义县", "新建县", "南昌县", "青山湖区", "湾里区", "青云谱区"],
        "景德镇市": ["乐平市", "浮梁县", "珠山区", "昌江区", "市辖区"],
        "萍乡市": ["芦溪县", "上栗县", "莲花县", "湘东区", "安源区", "市辖区"],
        "九江市": ["共青城市", "瑞昌市", "彭泽县", "湖口县", "都昌县", "星子县", "德安县", "永修县", "修水县", "武宁县", "九江县", "浔阳区", "庐山区", "市辖区"],
        "新余市": ["分宜县", "渝水区", "市辖区"],
        "鹰潭市": ["贵溪市", "余江县", "月湖区", "市辖区"],
        "赣州市": ["瑞金市", "石城县", "寻乌县", "会昌县", "兴国县", "于都县", "宁都县", "全南县", "定南县", "龙南县", "安远县", "崇义县", "上犹县", "大余县", "信丰县", "赣县", "南康区", "章贡区", "市辖区"],
        "吉安市": ["峡江县", "吉水县", "吉安县", "青原区", "吉州区", "市辖区", "井冈山市", "永新县", "安福县", "万安县", "遂川县", "泰和县", "永丰县", "新干县"],
        "宜春市": ["高安市", "樟树市", "丰城市", "铜鼓县", "靖安县", "宜丰县", "上高县", "万载县", "奉新县", "袁州区", "市辖区"],
        "抚州市": ["广昌县", "东乡县", "资溪县", "金溪县", "宜黄县", "乐安县", "崇仁县", "南丰县", "黎川县", "南城县", "临川区", "市辖区"],
        "上饶市": ["市辖区", "德兴市", "婺源县", "万年县", "鄱阳县", "余干县", "弋阳县", "横峰县", "铅山县", "玉山县", "广丰县", "上饶县", "信州区"],
        "济南市": ["章丘市", "商河县", "济阳县", "平阴县", "长清区", "历城区", "天桥区", "槐荫区", "市中区", "历下区", "市辖区"],
        "青岛市": ["即墨市", "胶州市", "城阳区", "李沧区", "崂山区", "黄岛区", "市北区", "市南区", "市辖区", "莱西市", "平度市"],
        "淄博市": ["沂源县", "高青县", "桓台县", "周村区", "临淄区", "博山区", "张店区", "淄川区", "市辖区"],
        "枣庄市": ["滕州市", "山亭区", "台儿庄区", "峄城区", "薛城区", "市中区", "市辖区"],
        "东营市": ["广饶县", "利津县", "垦利县", "河口区", "东营区", "市辖区"],
        "烟台市": ["莱阳市", "龙口市", "长岛县", "莱山区", "牟平区", "福山区", "芝罘区", "市辖区", "海阳市", "栖霞市", "招远市", "蓬莱市", "莱州市"],
        "潍坊市": ["昌邑市", "高密市", "安丘市", "寿光市", "诸城市", "青州市", "昌乐县", "临朐县", "奎文区", "坊子区", "寒亭区", "潍城区", "市辖区"],
        "济宁市": ["邹城市", "曲阜市", "梁山县", "泗水县", "汶上县", "嘉祥县", "金乡县", "鱼台县", "微山县", "兖州区", "任城区", "市辖区"],
        "泰安市": ["泰山区", "市辖区", "肥城市", "新泰市", "东平县", "宁阳县", "岱岳区"],
        "威海市": ["乳山市", "荣成市", "文登市", "环翠区", "市辖区"],
        "日照市": ["莒县", "五莲县", "岚山区", "东港区", "市辖区"],
        "莱芜市": ["钢城区", "莱城区", "市辖区"],
        "临沂市": ["临沭县", "蒙阴县", "莒南县", "平邑县", "费县", "兰陵县", "沂水县", "郯城县", "沂南县", "河东区", "罗庄区", "兰山区", "市辖区"],
        "德州市": ["市辖区", "禹城市", "乐陵市", "武城县", "夏津县", "平原县", "齐河县", "临邑县", "庆云县", "宁津县", "陵城区", "德城区"],
        "聊城市": ["临清市", "高唐县", "冠县", "东阿县", "茌平县", "莘县", "阳谷县", "东昌府区", "市辖区"],
        "滨州市": ["邹平县", "博兴县", "无棣县", "阳信县", "惠民县", "沾化区", "滨城区", "市辖区"],
        "菏泽市": ["单县", "曹县", "牡丹区", "市辖区", "东明县", "定陶县", "鄄城县", "郓城县", "巨野县", "成武县"],
        "郑州市": ["登封市", "新郑市", "新密市", "荥阳市", "巩义市", "中牟县", "惠济区", "上街区", "金水区", "管城回族区", "二七区", "中原区", "市辖区"],
        "开封市": ["兰考县", "尉氏县", "通许县", "杞县", "祥符区", "禹王台区", "鼓楼区", "顺河回族区", "龙亭区", "市辖区"],
        "洛阳市": ["西工区", "老城区", "市辖区", "偃师市", "伊川县", "洛宁县", "宜阳县", "汝阳县", "嵩县", "栾川县", "新安县", "孟津县", "洛龙区", "吉利区", "涧西区", "瀍河回族区"],
        "平顶山市": ["汝州市", "舞钢市", "郏县", "鲁山县", "叶县", "宝丰县", "湛河区", "石龙区", "卫东区", "新华区", "市辖区"],
        "安阳市": ["内黄县", "滑县", "汤阴县", "安阳县", "龙安区", "殷都区", "文峰区", "北关区", "市辖区", "林州市"],
        "鹤壁市": ["淇县", "浚县", "淇滨区", "山城区", "鹤山区", "市辖区"],
        "新乡市": ["辉县市", "卫辉市", "长垣县", "封丘县", "延津县", "原阳县", "获嘉县", "新乡县", "牧野区", "凤泉区", "卫滨区", "红旗区", "市辖区"],
        "焦作市": ["孟州市", "沁阳市", "温县", "武陟县", "博爱县", "修武县", "山阳区", "马村区", "中站区", "解放区", "市辖区"],
        "濮阳市": ["市辖区", "濮阳县", "台前县", "范县", "南乐县", "清丰县", "华龙区"],
        "许昌市": ["长葛市", "禹州市", "襄城县", "鄢陵县", "许昌县", "魏都区", "市辖区"],
        "漯河市": ["临颍县", "舞阳县", "召陵区", "郾城区", "源汇区", "市辖区"],
        "三门峡市": ["灵宝市", "义马市", "卢氏县", "陕县", "渑池县", "湖滨区", "市辖区"],
        "南阳市": ["西峡县", "方城县", "南召县", "卧龙区", "宛城区", "市辖区", "邓州市", "桐柏县", "新野县", "唐河县", "社旗县", "淅川县", "内乡县", "镇平县"],
        "商丘市": ["永城市", "夏邑县", "虞城县", "柘城县", "宁陵县", "睢县", "民权县", "睢阳区", "梁园区", "市辖区"],
        "信阳市": ["息县", "淮滨县", "潢川县", "固始县", "商城县", "新县", "光山县", "罗山县", "平桥区", "浉河区", "市辖区"],
        "周口市": ["扶沟县", "川汇区", "市辖区", "项城市", "鹿邑县", "太康县", "淮阳县", "郸城县", "沈丘县", "商水县", "西华县"],
        "驻马店市": ["新蔡县", "遂平县", "汝南县", "泌阳县", "确山县", "正阳县", "平舆县", "上蔡县", "西平县", "驿城区", "市辖区"],
        "河南省直辖县级行政区划": ["济源市"],
        "武汉市": ["江夏区", "蔡甸区", "汉南区", "东西湖区", "洪山区", "青山区", "武昌区", "汉阳区", "硚口区", "江汉区", "江岸区", "市辖区", "新洲区", "黄陂区"],
        "黄石市": ["大冶市", "阳新县", "铁山区", "下陆区", "西塞山区", "黄石港区", "市辖区"],
        "十堰市": ["丹江口市", "房县", "竹溪县", "竹山县", "郧西县", "郧阳区", "张湾区", "茅箭区", "市辖区"],
        "宜昌市": ["枝江市", "当阳市", "宜都市", "五峰土家族自治县", "长阳土家族自治县", "秭归县", "兴山县", "远安县", "夷陵区", "猇亭区", "点军区", "伍家岗区", "西陵区", "市辖区"],
        "襄阳市": ["宜城市", "枣阳市", "老河口市", "保康县", "谷城县", "南漳县", "襄州区", "樊城区", "襄城区", "市辖区"],
        "鄂州市": ["鄂城区", "华容区", "梁子湖区", "市辖区"],
        "荆门市": ["钟祥市", "沙洋县", "京山县", "掇刀区", "东宝区", "市辖区"],
        "孝感市": ["汉川市", "安陆市", "应城市", "云梦县", "大悟县", "孝昌县", "孝南区", "市辖区"],
        "荆州市": ["公安县", "荆州区", "沙市区", "市辖区", "松滋市", "洪湖市", "石首市", "江陵县", "监利县"],
        "黄冈市": ["武穴市", "麻城市", "黄梅县", "蕲春县", "浠水县", "英山县", "罗田县", "红安县", "团风县", "黄州区", "市辖区"],
        "咸宁市": ["赤壁市", "通山县", "崇阳县", "通城县", "嘉鱼县", "咸安区", "市辖区"],
        "随州市": ["广水市", "随县", "曾都区", "市辖区"],
        "恩施土家族苗族自治州": ["宣恩县", "巴东县", "建始县", "利川市", "恩施市", "鹤峰县", "来凤县", "咸丰县"],
        "湖北省直辖县级行政区划": ["神农架林区", "天门市", "潜江市", "仙桃市"],
        "长沙市": ["浏阳市", "宁乡县", "长沙县", "望城区", "雨花区", "开福区", "岳麓区", "天心区", "芙蓉区", "市辖区"],
        "株洲市": ["醴陵市", "炎陵县", "茶陵县", "攸县", "株洲县", "天元区", "石峰区", "芦淞区", "荷塘区", "市辖区"],
        "湘潭市": ["湘乡市", "湘潭县", "岳塘区", "雨湖区", "市辖区", "韶山市"],
        "衡阳市": ["常宁市", "耒阳市", "祁东县", "衡东县", "衡山县", "衡南县", "衡阳县", "南岳区", "蒸湘区", "石鼓区", "雁峰区", "珠晖区", "市辖区"],
        "邵阳市": ["武冈市", "城步苗族自治县", "新宁县", "绥宁县", "洞口县", "隆回县", "邵阳县", "新邵县", "邵东县", "北塔区", "大祥区", "双清区", "市辖区"],
        "岳阳市": ["岳阳县", "君山区", "云溪区", "岳阳楼区", "市辖区", "临湘市", "汨罗市", "平江县", "湘阴县", "华容县"],
        "常德市": ["津市市", "石门县", "桃源县", "临澧县", "澧县", "汉寿县", "安乡县", "鼎城区", "武陵区", "市辖区"],
        "张家界市": ["桑植县", "慈利县", "武陵源区", "永定区", "市辖区"],
        "益阳市": ["沅江市", "安化县", "桃江县", "南县", "赫山区", "资阳区", "市辖区"],
        "郴州市": ["宜章县", "桂阳县", "苏仙区", "北湖区", "市辖区", "资兴市", "安仁县", "桂东县", "汝城县", "临武县", "嘉禾县", "永兴县"],
        "永州市": ["江华瑶族自治县", "新田县", "蓝山县", "宁远县", "江永县", "道县", "双牌县", "东安县", "祁阳县", "冷水滩区", "零陵区", "市辖区"],
        "怀化市": ["洪江市", "通道侗族自治县", "靖州苗族侗族自治县", "芷江侗族自治县", "新晃侗族自治县", "麻阳苗族自治县", "会同县", "溆浦县", "辰溪县", "沅陵县", "中方县", "鹤城区", "市辖区"],
        "娄底市": ["涟源市", "冷水江市", "新化县", "双峰县", "娄星区", "市辖区"],
        "湘西土家族苗族自治州": ["龙山县", "永顺县", "古丈县", "保靖县", "花垣县", "凤凰县", "泸溪县", "吉首市"],
        "广州市": ["增城区", "从化区", "南沙区", "花都区", "番禺区", "黄埔区", "白云区", "天河区", "海珠区", "越秀区", "荔湾区", "市辖区"],
        "韶关市": ["仁化县", "始兴县", "曲江区", "浈江区", "武江区", "市辖区", "南雄市", "乐昌市", "新丰县", "乳源瑶族自治县", "翁源县"],
        "深圳市": ["盐田区", "龙岗区", "宝安区", "南山区", "福田区", "罗湖区", "市辖区"],
        "珠海市": ["金湾区", "斗门区", "香洲区", "市辖区"],
        "汕头市": ["南澳县", "澄海区", "潮南区", "潮阳区", "濠江区", "金平区", "龙湖区", "市辖区"],
        "佛山市": ["高明区", "三水区", "顺德区", "南海区", "禅城区", "市辖区"],
        "江门市": ["蓬江区", "市辖区", "恩平市", "鹤山市", "开平市", "台山市", "新会区", "江海区"],
        "湛江市": ["吴川市", "雷州市", "廉江市", "徐闻县", "遂溪县", "麻章区", "坡头区", "霞山区", "赤坎区", "市辖区"],
        "茂名市": ["信宜市", "化州市", "高州市", "电白区", "茂南区", "市辖区"],
        "肇庆市": ["四会市", "高要市", "德庆县", "封开县", "怀集县", "广宁县", "鼎湖区", "端州区", "市辖区"],
        "惠州市": ["市辖区", "龙门县", "惠东县", "博罗县", "惠阳区", "惠城区"],
        "梅州市": ["兴宁市", "蕉岭县", "平远县", "五华县", "丰顺县", "大埔县", "梅县区", "梅江区", "市辖区"],
        "汕尾市": ["陆丰市", "陆河县", "海丰县", "城区", "市辖区"],
        "河源市": ["东源县", "和平县", "连平县", "龙川县", "紫金县", "源城区", "市辖区"],
        "阳江市": ["阳春市", "阳西县", "阳东区", "江城区", "市辖区"],
        "清远市": ["市辖区", "连州市", "英德市", "连南瑶族自治县", "连山壮族瑶族自治县", "阳山县", "佛冈县", "清新区", "清城区"],
        "潮州市": ["饶平县", "潮安区", "湘桥区", "市辖区"],
        "揭阳市": ["普宁市", "惠来县", "揭西县", "揭东区", "榕城区", "市辖区"],
        "云浮市": ["罗定市", "郁南县", "新兴县", "云安区", "云城区", "市辖区"],
        "南宁市": ["隆安县", "武鸣县", "邕宁区", "良庆区", "西乡塘区", "江南区", "兴宁区", "青秀区", "市辖区", "横县", "宾阳县", "上林县", "马山县"],
        "柳州市": ["三江侗族自治县", "融水苗族自治县", "融安县", "鹿寨县", "柳城县", "柳江县", "柳北区", "柳南区", "鱼峰区", "城中区", "市辖区"],
        "桂林市": ["荔浦县", "平乐县", "资源县", "龙胜各族自治县", "灌阳县", "永福县", "兴安县", "全州县", "灵川县", "阳朔县", "临桂区", "雁山区", "七星区", "象山区", "叠彩区", "秀峰区", "市辖区", "恭城瑶族自治县"],
        "梧州市": ["岑溪市", "蒙山县", "藤县", "苍梧县", "龙圩区", "长洲区", "万秀区", "市辖区"],
        "北海市": ["合浦县", "铁山港区", "银海区", "海城区", "市辖区"],
        "防城港市": ["东兴市", "上思县", "防城区", "港口区", "市辖区"],
        "钦州市": ["浦北县", "灵山县", "钦北区", "钦南区", "市辖区"],
        "贵港市": ["桂平市", "平南县", "覃塘区", "港南区", "港北区", "市辖区"],
        "玉林市": ["玉州区", "市辖区", "北流市", "兴业县", "博白县", "陆川县", "容县", "福绵区"],
        "百色市": ["隆林各族自治县", "西林县", "田林县", "乐业县", "凌云县", "那坡县", "靖西县", "德保县", "平果县", "田东县", "田阳县", "右江区", "市辖区"],
        "贺州市": ["富川瑶族自治县", "钟山县", "昭平县", "平桂管理区", "八步区", "市辖区"],
        "河池市": ["罗城仫佬族自治县", "东兰县", "凤山县", "天峨县", "南丹县", "金城江区", "市辖区", "宜州市", "大化瑶族自治县", "都安瑶族自治县", "巴马瑶族自治县", "环江毛南族自治县"],
        "来宾市": ["合山市", "金秀瑶族自治县", "武宣县", "象州县", "忻城县", "兴宾区", "市辖区"],
        "崇左市": ["凭祥市", "天等县", "大新县", "龙州县", "宁明县", "扶绥县", "江州区", "市辖区"],
        "海口市": ["美兰区", "琼山区", "龙华区", "秀英区", "市辖区"],
        "三亚市": ["崖州区", "天涯区", "吉阳区", "海棠区", "市辖区"],
        "三沙市": ["南沙群岛", "西沙群岛", "中沙群岛的岛礁及其海域"],
        "海南省直辖县级行政区划": ["琼中黎族苗族自治县", "保亭黎族苗族自治县", "陵水黎族自治县", "乐东黎族自治县", "昌江黎族自治县", "白沙黎族自治县", "临高县", "澄迈县", "屯昌县", "定安县", "东方市", "万宁市", "文昌市", "儋州市", "琼海市", "五指山市"],
        "重庆市": ["长寿区", "黔江区", "巴南区", "渝北区", "大足区", "綦江区", "北碚区", "南岸区", "九龙坡区", "沙坪坝区", "彭水苗族土家族自治县", "江北区", "酉阳土家族苗族自治县", "大渡口区", "秀山土家族苗族自治县", "渝中区", "石柱土家族自治县", "涪陵区", "巫溪县", "万州区", "巫山县", "奉节县", "云阳县", "开县", "忠县", "武隆县", "垫江县", "丰都县", "城口县", "梁平县", "荣昌县", "潼南县", "铜梁区", "璧山区", "南川区", "永川区", "合川区", "江津区"],
        "成都市": ["新都区", "青白江区", "龙泉驿区", "成华区", "武侯区", "金牛区", "青羊区", "锦江区", "市辖区", "崇州市", "邛崃市", "彭州市", "都江堰市", "新津县", "蒲江县", "大邑县", "郫县", "双流县", "金堂县", "温江区"],
        "自贡市": ["富顺县", "荣县", "沿滩区", "大安区", "贡井区", "自流井区", "市辖区"],
        "攀枝花市": ["盐边县", "米易县", "仁和区", "西区", "东区", "市辖区"],
        "泸州市": ["古蔺县", "叙永县", "合江县", "泸县", "龙马潭区", "纳溪区", "江阳区", "市辖区"],
        "德阳市": ["绵竹市", "什邡市", "广汉市", "罗江县", "中江县", "旌阳区", "市辖区"],
        "绵阳市": ["江油市", "平武县", "北川羌族自治县", "梓潼县", "安县", "盐亭县", "三台县", "游仙区", "涪城区", "市辖区"],
        "广元市": ["苍溪县", "剑阁县", "青川县", "旺苍县", "朝天区", "昭化区", "利州区", "市辖区"],
        "遂宁市": ["大英县", "射洪县", "蓬溪县", "安居区", "船山区", "市辖区"],
        "内江市": ["市辖区", "隆昌县", "资中县", "威远县", "东兴区", "市中区"],
        "乐山市": ["峨眉山市", "马边彝族自治县", "峨边彝族自治县", "沐川县", "夹江县", "井研县", "犍为县", "金口河区", "五通桥区", "沙湾区", "市中区", "市辖区"],
        "南充市": ["阆中市", "西充县", "仪陇县", "蓬安县", "营山县", "南部县", "嘉陵区", "高坪区", "顺庆区", "市辖区"],
        "眉山市": ["洪雅县", "仁寿县", "彭山区", "东坡区", "市辖区", "青神县", "丹棱县"],
        "宜宾市": ["屏山县", "兴文县", "筠连县", "珙县", "高县", "长宁县", "江安县", "宜宾县", "南溪区", "翠屏区", "市辖区"],
        "广安市": ["华蓥市", "邻水县", "武胜县", "岳池县", "前锋区", "广安区", "市辖区"],
        "达州市": ["万源市", "渠县", "大竹县", "开江县", "宣汉县", "达川区", "通川区", "市辖区"],
        "雅安市": ["荥经县", "名山区", "雨城区", "市辖区", "宝兴县", "芦山县", "天全县", "石棉县", "汉源县"],
        "巴中市": ["平昌县", "南江县", "通江县", "恩阳区", "巴州区", "市辖区"],
        "资阳市": ["简阳市", "乐至县", "安岳县", "雁江区", "市辖区"],
        "阿坝藏族羌族自治州": ["红原县", "若尔盖县", "阿坝县", "壤塘县", "马尔康县", "黑水县", "小金县", "金川县", "九寨沟县", "松潘县", "茂县", "理县", "汶川县"],
        "甘孜藏族自治州": ["丹巴县", "泸定县", "康定县", "得荣县", "稻城县", "乡城县", "巴塘县", "理塘县", "色达县", "石渠县", "白玉县", "德格县", "新龙县", "甘孜县", "炉霍县", "道孚县", "雅江县", "九龙县"],
        "凉山彝族自治州": ["雷波县", "美姑县", "甘洛县", "越西县", "冕宁县", "喜德县", "昭觉县", "金阳县", "布拖县", "普格县", "宁南县", "会东县", "会理县", "德昌县", "盐源县", "木里藏族自治县", "西昌市"],
        "贵阳市": ["清镇市", "修文县", "息烽县", "开阳县", "观山湖区", "白云区", "乌当区", "花溪区", "云岩区", "南明区", "市辖区"],
        "六盘水市": ["盘县", "水城县", "六枝特区", "钟山区"],
        "遵义市": ["仁怀市", "赤水市", "习水县", "余庆县", "湄潭县", "凤冈县", "务川仡佬族苗族自治县", "道真仡佬族苗族自治县", "正安县", "绥阳县", "桐梓县", "遵义县", "汇川区", "红花岗区", "市辖区"],
        "安顺市": ["西秀区", "市辖区", "紫云苗族布依族自治县", "关岭布依族苗族自治县", "镇宁布依族苗族自治县", "普定县", "平坝区"],
        "毕节市": ["赫章县", "威宁彝族回族苗族自治县", "纳雍县", "织金县", "金沙县", "黔西县", "大方县", "七星关区", "市辖区"],
        "铜仁市": ["松桃苗族自治县", "沿河土家族自治县", "德江县", "印江土家族苗族自治县", "思南县", "石阡县", "玉屏侗族自治县", "江口县", "万山区", "碧江区", "市辖区"],
        "黔西南布依族苗族自治州": ["册亨县", "望谟县", "贞丰县", "晴隆县", "普安县", "兴仁县", "兴义市", "安龙县"],
        "黔东南苗族侗族自治州": ["丹寨县", "麻江县", "雷山县", "从江县", "榕江县", "黎平县", "台江县", "剑河县", "锦屏县", "天柱县", "岑巩县", "镇远县", "三穗县", "施秉县", "黄平县", "凯里市"],
        "黔南布依族苗族自治州": ["三都水族自治县", "惠水县", "龙里县", "长顺县", "罗甸县", "平塘县", "独山县", "瓮安县", "贵定县", "荔波县", "福泉市", "都匀市"],
        "昆明市": ["盘龙区", "五华区", "市辖区", "安宁市", "寻甸回族彝族自治县", "禄劝彝族苗族自治县", "嵩明县", "石林彝族自治县", "宜良县", "富民县", "晋宁县", "呈贡区", "东川区", "西山区", "官渡区"],
        "曲靖市": ["宣威市", "沾益县", "会泽县", "富源县", "罗平县", "师宗县", "陆良县", "马龙县", "麒麟区", "市辖区"],
        "玉溪市": ["元江哈尼族彝族傣族自治县", "新平彝族傣族自治县", "峨山彝族自治县", "易门县", "华宁县", "澄江县", "通海县", "江川县", "红塔区", "市辖区"],
        "保山市": ["市辖区", "昌宁县", "龙陵县", "腾冲县", "施甸县", "隆阳区"],
        "昭通市": ["水富县", "威信县", "彝良县", "镇雄县", "绥江县", "永善县", "大关县", "盐津县", "巧家县", "鲁甸县", "昭阳区", "市辖区"],
        "丽江市": ["宁蒗彝族自治县", "华坪县", "永胜县", "玉龙纳西族自治县", "古城区", "市辖区"],
        "普洱市": ["孟连傣族拉祜族佤族自治县", "江城哈尼族彝族自治县", "镇沅彝族哈尼族拉祜族自治县", "景谷傣族彝族自治县", "景东彝族自治县", "墨江哈尼族自治县", "宁洱哈尼族彝族自治县", "思茅区", "市辖区", "西盟佤族自治县", "澜沧拉祜族自治县"],
        "临沧市": ["沧源佤族自治县", "耿马傣族佤族自治县", "双江拉祜族佤族布朗族傣族自治县", "镇康县", "永德县", "云县", "凤庆县", "临翔区", "市辖区"],
        "楚雄彝族自治州": ["禄丰县", "武定县", "元谋县", "永仁县", "大姚县", "姚安县", "南华县", "牟定县", "双柏县", "楚雄市"],
        "红河哈尼族彝族自治州": ["金平苗族瑶族傣族自治县", "红河县", "元阳县", "泸西县", "石屏县", "建水县", "屏边苗族自治县", "弥勒市", "蒙自市", "开远市", "个旧市", "河口瑶族自治县", "绿春县"],
        "文山壮族苗族自治州": ["富宁县", "广南县", "丘北县", "马关县", "麻栗坡县", "西畴县", "砚山县", "文山市"],
        "西双版纳傣族自治州": ["勐腊县", "勐海县", "景洪市"],
        "大理白族自治州": ["鹤庆县", "剑川县", "洱源县", "云龙县", "永平县", "巍山彝族回族自治县", "南涧彝族自治县", "弥渡县", "宾川县", "祥云县", "漾濞彝族自治县", "大理市"],
        "德宏傣族景颇族自治州": ["陇川县", "盈江县", "梁河县", "芒市", "瑞丽市"],
        "怒江傈僳族自治州": ["福贡县", "泸水县", "兰坪白族普米族自治县", "贡山独龙族怒族自治县"],
        "迪庆藏族自治州": ["维西傈僳族自治县", "德钦县", "香格里拉市"],
        "拉萨市": ["墨竹工卡县", "达孜县", "堆龙德庆县", "曲水县", "尼木县", "当雄县", "林周县", "城关区", "市辖区"],
        "日喀则市": ["萨嘎县", "聂拉木县", "吉隆县", "亚东县", "仲巴县", "定结县", "康马县", "仁布县", "白朗县", "谢通门县", "昂仁县", "拉孜县", "萨迦县", "定日县", "江孜县", "南木林县", "桑珠孜区", "市辖区", "岗巴县"],
        "昌都市": ["边坝县", "洛隆县", "芒康县", "左贡县", "八宿县", "察雅县", "丁青县", "类乌齐县", "贡觉县", "江达县", "卡若区", "市辖区"],
        "山南地区": ["浪卡子县", "错那县", "隆子县", "加查县", "洛扎县", "措美县", "曲松县", "琼结县", "桑日县", "贡嘎县", "扎囊县", "乃东县"],
        "那曲地区": ["索县", "申扎县", "安多县", "聂荣县", "比如县", "嘉黎县", "那曲县", "双湖县", "尼玛县", "巴青县", "班戈县"],
        "阿里地区": ["措勤县", "改则县", "革吉县", "日土县", "噶尔县", "札达县", "普兰县"],
        "林芝地区": ["朗县", "察隅县", "波密县", "墨脱县", "米林县", "工布江达县", "林芝县"],
        "西安市": ["户县", "周至县", "蓝田县", "高陵区", "长安区", "临潼区", "阎良区", "雁塔区", "未央区", "灞桥区", "莲湖区", "碑林区", "新城区", "市辖区"],
        "铜川市": ["宜君县", "耀州区", "印台区", "王益区", "市辖区"],
        "宝鸡市": ["太白县", "凤县", "麟游县", "千阳县", "陇县", "眉县", "扶风县", "岐山县", "凤翔县", "陈仓区", "金台区", "渭滨区", "市辖区"],
        "咸阳市": ["武功县", "淳化县", "旬邑县", "长武县", "彬县", "永寿县", "礼泉县", "乾县", "泾阳县", "三原县", "渭城区", "杨陵区", "秦都区", "市辖区", "兴平市"],
        "渭南市": ["华阴市", "韩城市", "富平县", "白水县", "蒲城县", "澄城县", "合阳县", "大荔县", "潼关县", "华县", "临渭区", "市辖区"],
        "延安市": ["黄陵县", "黄龙县", "宜川县", "洛川县", "富县", "甘泉县", "吴起县", "志丹县", "安塞县", "子长县", "延川县", "延长县", "宝塔区", "市辖区"],
        "汉中市": ["洋县", "城固县", "南郑县", "汉台区", "市辖区", "佛坪县", "留坝县", "镇巴县", "略阳县", "宁强县", "勉县", "西乡县"],
        "榆林市": ["子洲县", "清涧县", "吴堡县", "佳县", "米脂县", "绥德县", "定边县", "靖边县", "横山县", "府谷县", "神木县", "榆阳区", "市辖区"],
        "安康市": ["白河县", "旬阳县", "镇坪县", "平利县", "岚皋县", "紫阳县", "宁陕县", "石泉县", "汉阴县", "市辖区"],
        "商洛市": ["商州区", "市辖区", "柞水县", "镇安县", "山阳县", "商南县", "丹凤县", "洛南县"],
        "兰州市": ["榆中县", "皋兰县", "永登县", "红古区", "安宁区", "西固区", "七里河区", "城关区", "市辖区"],
        "嘉峪关市": ["市辖区"],
        "金昌市": ["永昌县", "金川区", "市辖区"],
        "白银市": ["景泰县", "会宁县", "靖远县", "平川区", "白银区", "市辖区"],
        "天水市": ["武山县", "甘谷县", "秦安县", "清水县", "麦积区", "秦州区", "市辖区", "张家川回族自治县"],
        "武威市": ["天祝藏族自治县", "古浪县", "民勤县", "凉州区", "市辖区"],
        "张掖市": ["山丹县", "高台县", "临泽县", "民乐县", "肃南裕固族自治县", "甘州区", "市辖区"],
        "平凉市": ["静宁县", "庄浪县", "华亭县", "崇信县", "灵台县", "泾川县", "崆峒区", "市辖区"],
        "酒泉市": ["敦煌市", "玉门市", "阿克塞哈萨克族自治县", "肃北蒙古族自治县", "瓜州县", "金塔县", "肃州区", "市辖区"],
        "庆阳市": ["庆城县", "西峰区", "市辖区", "镇原县", "宁县", "正宁县", "合水县", "华池县", "环县"],
        "定西市": ["岷县", "漳县", "临洮县", "渭源县", "陇西县", "通渭县", "安定区", "市辖区"],
        "陇南市": ["两当县", "徽县", "礼县", "西和县", "康县", "宕昌县", "文县", "成县", "武都区", "市辖区"],
        "临夏回族自治州": ["积石山保安族东乡族撒拉族自治县", "东乡族自治县", "和政县", "广河县", "永靖县", "康乐县", "临夏县", "临夏市"],
        "甘南藏族自治州": ["夏河县", "碌曲县", "玛曲县", "迭部县", "舟曲县", "卓尼县", "临潭县", "合作市"],
        "西宁市": ["湟源县", "湟中县", "大通回族土族自治县", "城北区", "城西区", "城中区", "城东区", "市辖区"],
        "海东市": ["循化撒拉族自治县", "化隆回族自治县", "互助土族自治县", "民和回族土族自治县", "平安县", "乐都区", "市辖区"],
        "海北藏族自治州": ["刚察县", "海晏县", "祁连县", "门源回族自治县"],
        "黄南藏族自治州": ["河南蒙古族自治县", "泽库县", "尖扎县", "同仁县"],
        "海南藏族自治州": ["共和县", "贵南县", "兴海县", "贵德县", "同德县"],
        "果洛藏族自治州": ["玛多县", "久治县", "达日县", "甘德县", "班玛县", "玛沁县"],
        "玉树藏族自治州": ["曲麻莱县", "囊谦县", "治多县", "称多县", "杂多县", "玉树市"],
        "海西蒙古族藏族自治州": ["天峻县", "都兰县", "乌兰县", "德令哈市", "格尔木市"],
        "银川市": ["灵武市", "贺兰县", "永宁县", "金凤区", "西夏区", "兴庆区", "市辖区"],
        "石嘴山市": ["平罗县", "惠农区", "大武口区", "市辖区"],
        "吴忠市": ["青铜峡市", "同心县", "盐池县", "红寺堡区", "利通区", "市辖区"],
        "固原市": ["彭阳县", "泾源县", "隆德县", "西吉县", "原州区", "市辖区"],
        "中卫市": ["海原县", "中宁县", "沙坡头区", "市辖区"],
        "乌鲁木齐市": ["乌鲁木齐县", "米东区", "达坂城区", "头屯河区", "水磨沟区", "新市区", "沙依巴克区", "天山区", "市辖区"],
        "克拉玛依市": ["乌尔禾区", "白碱滩区", "克拉玛依区", "独山子区", "市辖区"],
        "吐鲁番地区": ["鄯善县", "吐鲁番市", "托克逊县"],
        "哈密地区": ["伊吾县", "巴里坤哈萨克自治县", "哈密市"],
        "昌吉回族自治州": ["木垒哈萨克自治县", "吉木萨尔县", "奇台县", "玛纳斯县", "呼图壁县", "阜康市", "昌吉市"],
        "博尔塔拉蒙古自治州": ["温泉县", "精河县", "阿拉山口市", "博乐市"],
        "巴音郭楞蒙古自治州": ["博湖县", "和硕县", "和静县", "焉耆回族自治县", "且末县", "若羌县", "尉犁县", "轮台县", "库尔勒市"],
        "阿克苏地区": ["柯坪县", "阿瓦提县", "乌什县", "拜城县", "新和县", "沙雅县", "温宿县", "库车县", "阿克苏市"],
        "克孜勒苏柯尔克孜自治州": ["乌恰县", "阿合奇县", "阿克陶县", "阿图什市"],
        "喀什地区": ["塔什库尔干塔吉克自治县", "巴楚县", "伽师县", "岳普湖县", "麦盖提县", "叶城县", "莎车县", "泽普县", "英吉沙县", "疏勒县", "疏附县", "喀什市"],
        "和田地区": ["民丰县", "于田县", "策勒县", "洛浦县", "皮山县", "墨玉县", "和田县", "和田市"],
        "伊犁哈萨克自治州": ["新源县", "巩留县", "霍城县", "察布查尔锡伯自治县", "伊宁县", "霍尔果斯市", "奎屯市", "伊宁市", "吉木乃县", "青河县", "哈巴河县", "福海县", "富蕴县", "布尔津县", "阿勒泰市", "阿勒泰地区", "和布克赛尔蒙古自治县", "裕民县", "托里县", "沙湾县", "额敏县", "乌苏市", "塔城市", "塔城地区", "尼勒克县", "特克斯县", "昭苏县"],
        "自治区直辖县级行政区划": ["双河市", "铁门关市", "北屯市", "五家渠市", "图木舒克市", "阿拉尔市", "石河子市"],
        "台北市": ["大同区", "中正区", "中山区", "大安区", "信义区", "松山区", "北投区", "士林区", "内湖区", "南港区", "文山区", "万华区"],
        "高雄市": ["茄萣区", "湖内区", "路竹区", "阿莲区", "田寮区", "燕巢区", "桥头区", "冈山区", "鸟松区", "仁武区", "大社区", "大树区", "大寮区", "林园区", "凤山区", "小港区", "旗津区", "前镇区", "苓雅区", "前金区", "新兴区", "那玛夏区", "三民区", "桃源区", "楠梓区", "茂林区", "左营区", "内门区", "鼓山区", "杉林区", "盐埕区", "甲仙区", "六龟区", "美浓区", "旗山区", "梓官区", "弥陀区", "永安区"],
        "基隆市": ["信义区", "安乐区", "中山区", "仁爱区", "暖暖区", "七堵区", "中正区"],
        "台中市": ["沙鹿区", "清水区", "大甲区", "东势区", "丰原区", "北屯区", "南屯区", "西屯区", "北区", "西区", "南区", "东区", "中区", "和平区", "大里区", "太平区", "雾峰区", "龙井区", "大肚区", "乌日区", "大安区", "外埔区", "石冈区", "新社区", "大雅区", "潭子区", "神冈区", "后里区", "梧栖区"],
        "台南市": ["官田区", "六甲区", "下营区", "麻豆区", "东山区", "后壁区", "柳营区", "白河区", "盐水区", "新营区", "中西区", "安平区", "永康区", "安南区", "龙崎区", "北区", "关庙区", "南区", "归仁区", "东区", "仁德区", "左镇区", "南化区", "楠西区", "玉井区", "山上区", "安定区", "新市区", "善化区", "新化区", "北门区", "将军区", "七股区", "西港区", "学甲区", "佳里区", "大内区"],
        "新竹市": ["香山区", "北区", "东区"],
        "嘉义市": ["西区", "东区"],
        "新北市": ["新店区", "新庄区", "永和区", "中和区", "三重区", "板桥区", "乌来区", "万里区", "金山区", "贡寮区", "双溪区", "平溪区", "八里区", "石门区", "三芝区", "坪林区", "石碇区", "深坑区", "林口区", "泰山区", "五股区", "芦洲区", "土城区", "瑞芳区", "汐止区", "淡水区", "三峡区", "莺歌区", "树林区"],
        "宜兰县": ["五结乡", "冬山乡", "员山乡", "壮围乡", "礁溪乡", "头城镇", "苏澳镇", "罗东镇", "宜兰市", "南澳乡", "大同乡", "三星乡"],
        "桃园县": ["复兴乡", "观音乡", "新屋乡", "龙潭乡", "龟山乡", "大园乡", "芦竹乡", "大溪镇", "杨梅市", "八德市", "平镇市", "中坜市", "桃园市"],
        "新竹县": ["五峰乡", "尖石乡", "峨眉乡", "宝山乡", "北埔乡", "橫山乡", "芎林乡", "新丰乡", "湖口乡", "关西镇", "新埔镇", "竹东镇", "竹北市"],
        "苗栗县": ["通霄镇", "苑里镇", "苗栗市", "泰安乡", "狮潭乡", "三湾乡", "造桥乡", "西湖乡", "三义乡", "头屋乡", "南庄乡", "铜锣乡", "公馆乡", "大湖乡", "卓兰镇", "后龙镇", "头份镇", "竹南镇"],
        "彰化县": ["社头乡", "永靖乡", "埔心乡", "埔盐乡", "大村乡", "田中镇", "溪湖镇", "员林镇", "芬园乡", "花坛乡", "秀水乡", "福兴乡", "伸港乡", "线西乡", "和美镇", "鹿港镇", "彰化市", "溪州乡", "竹塘乡", "大城乡", "芳苑乡", "埤头乡", "田尾乡", "二林镇", "北斗镇", "二水乡"],
        "南投县": ["仁爱乡", "信义乡", "水里乡", "国姓乡", "鱼池乡", "中寮乡", "鹿谷乡", "名间乡", "集集镇", "竹山镇", "草屯镇", "埔里镇", "南投市"],
        "云林县": ["林内乡", "莿桐乡", "大埤乡", "古坑乡", "北港镇", "土库镇", "西螺镇", "虎尾镇", "斗南镇", "斗六市", "水林乡", "口湖乡", "四湖乡", "元长乡", "台西乡", "褒忠乡", "东势乡", "麦寮乡", "仑背乡", "二仑乡"],
        "嘉义县": ["阿里山乡", "大埔乡", "番路乡", "梅山乡", "竹崎乡", "中埔乡", "水上乡", "鹿草乡", "义竹乡", "东石乡", "六脚乡", "新港乡", "溪口乡", "民雄乡", "大林镇", "布袋镇", "朴子市", "太保市"],
        "屏东县": ["恒春镇", "东港镇", "潮州镇", "屏东市", "牡丹乡", "狮子乡", "春日乡", "来义乡", "泰武乡", "玛家乡", "雾台乡", "三地门乡", "枋山乡", "满州乡", "车城乡", "琉球乡", "佳冬乡", "南州乡", "林边乡", "崁顶乡", "新园乡", "枋寮乡", "新埤乡", "竹田乡", "内埔乡", "万峦乡", "高树乡", "盐埔乡", "里港乡", "九如乡", "麟洛乡", "长治乡", "万丹乡"],
        "台东县": ["关山镇", "成功镇", "台东市", "兰屿乡", "达仁乡", "金峰乡", "延平乡", "海端乡", "绿岛乡", "大武乡", "太麻里乡", "长滨乡", "东河乡", "池上乡", "鹿野乡", "卑南乡"],
        "花莲县": ["卓溪乡", "万荣乡", "秀林乡", "富里乡", "瑞穗乡", "丰滨乡", "光复乡", "寿丰乡", "吉安乡", "新城乡", "玉里镇", "凤林镇", "花莲市"],
        "澎湖县": ["七美乡", "望安乡", "西屿乡", "白沙乡", "湖西乡", "马公市"],
        "香港岛": ["南区", "东区", "湾仔区", "中西区"],
        "九龙": ["观塘区", "黄大仙区", "九龙城区", "深水埗区", "油尖旺区"],
        "新界": ["离岛区", "葵青区", "沙田区", "西贡区", "大埔区", "北区", "元朗区", "屯门区", "荃湾区"],
        "澳门半岛": ["风顺堂区", "望德堂区", "大堂区", "圣安多尼堂区", "花地玛堂区"],
        "氹仔岛": ["嘉模堂区"],
        "路环岛": ["圣方济各堂区"]
    };

    Address.prototype.TOOLS = function() {
        var that = this,
            options = this.options
        var tools = {
            change: function() {
                var $element = this.$element;
                if(!$element.val()) return;
                var $next = $(options.nextselect);
                if ($next && $next.length) {
                    if (options.role == 'province') {
                        this.tools.showCity($element.val(), $next);
                        var $county = $($next.data('nextselect'));
                        this.tools.showCounty($next.val(), $county);
                    } else if (options.role == 'city') {
                        this.tools.showCounty($element.val(), $next);
                    }
                }
            },
            showCity:function(parent,$container){
                var html = '';
                $.each(Address.city[parent], function(i, obj) {
                    html += '<option value="' + obj + '">' + obj + '</option>';
                });
                $container.html(html);
                $container.selectpicker('refresh');
            },
            showCounty:function(parent,$container){
                var html = '';
                $.each(Address.county[parent], function(i, obj) {
                    html += '<option value="' + obj + '">' + obj + '</option>';
                });
                $container.html(html);
                $container.selectpicker('refresh');
            }
        }

        return tools
    }

    Address.prototype.init = function() {
        var that = this
        var $element = this.$element
        var options = this.options

        $element.addClass("show-tick");
        if (!options.style) $element.data('style', 'btn-default')
        if (!options.width) $element.data('width', 'auto')
        if (!options.container) $element.data('container', 'body')
        else if (options.container == true) $element.attr('data-container', 'false').data('container', false)

        if (options.role == "province") {
            var html = '';
            html += '<option value="">请选择省/直辖市</option>';
            $.each(Address.province, function(i, obj) {
                html += '<option value="' + obj + '">' + obj + '</option>';
            });
            $element.html(html);
        }
        if (options.role == "city" && !options.selectpicker) {
            var html = '';
            html += '<option value="">请选择市</option>';
            $element.html(html);
        }
        if (options.role == "county" && !options.selectpicker) {
            var html = '';
            html += '<option value="">请选择区/县</option>';
            $element.html(html);
        }
        $element.selectpicker()

        $element.on('change', $.proxy(this.tools.change, this))

        if (options.val) {
            $element.selectpicker('val', options.val);
            $element.trigger('change');
        }
    }

    Address.prototype.destroy = function() {
        if (this.$address) {
            $address.remove()
        }
    }

    // ADDRESS PLUGIN DEFINITION
    // =======================

    function Plugin(option) {
        var args = arguments
        var property = option

        return this.each(function() {
            var $this = $(this)
            var options = $.extend({}, Address.DEFAULTS, $this.data(), typeof option == 'object' && option)
            var data = $this.data('bjui.address')

            if (!data) $this.data('bjui.address', (data = new Address(this, options)))
            if (typeof property == 'string' && $.isFunction(data[property])) {
                [].shift.apply(args)
                if (!args) data[property]()
                else data[property].apply(data, args)
            } else {
                data.init()
            }
        })
    }

    var old = $.fn.address

    $.fn.address = Plugin
    $.fn.address.Constructor = Address

    // ADDRESS NO CONFLICT
    // =================

    $.fn.address.noConflict = function() {
        $.fn.address = old
        return this
    }

    // ADDRESS DATA-API
    // ==============

    $(document).on(BJUI.eventType.initUI, function(e) {
        var $this = $(e.target).find('select[data-toggle="address"]')

        if (!$this.length) return

        Plugin.call($this)
    })

}(jQuery);
